Tekla Open API Reference for Tekla Structures 2025
Tekla.Structures.Filtering.Categories Namespace
The Tekla.Structures.Filtering.Categories namespace includes all the necessary Tekla Structures filter categories for creating the filter files.
Classes
Class | Description
AssemblyFilterExpressions
 The AssemblyFilterExpressions class contains all the assembly filter expressions.
AssemblyFilterExpressions.CustomBoolean
 The CustomBoolean class represents a custom Boolean filter expression.
AssemblyFilterExpressions.CustomDateTime
 The CustomDateTime class represents a custom DateTime filter expression.
AssemblyFilterExpressions.CustomNumber
 The CustomNumber class represents a custom numeric filter expression.
AssemblyFilterExpressions.CustomString
 The CustomString class represents a custom string filter expression.
AssemblyFilterExpressions.Guid
 The Guid class represents the GUID filter expression.
AssemblyFilterExpressions.IdNumber
 The IdNumber class represents the identifier number filter expression.
AssemblyFilterExpressions.Level
 The Level class represents the level filter expression.
AssemblyFilterExpressions.Name
 The Name class represents the name filter expression.
AssemblyFilterExpressions.Phase
 The Phase class represents the phase filter expression.
AssemblyFilterExpressions.PositionNumber
 The PositionNumber class represents the position number filter expression.
AssemblyFilterExpressions.Prefix
 The Prefix class represents the prefix filter expression.
AssemblyFilterExpressions.Series
 The Series class represents the series filter expression.
AssemblyFilterExpressions.StartNumber
 The StartNumber class represents the start number filter expression.
AssemblyFilterExpressions.Type
 The Type class represents the type filter expression.
BoltFilterExpressions
 The BoltFilterExpressions class contains all the bolt filter expressions.
BoltFilterExpressions.CustomBoolean
 The CustomBoolean class represents a custom Boolean filter expression.
BoltFilterExpressions.CustomDateTime
 The CustomDateTime class represents a custom DateTime filter expression.
BoltFilterExpressions.CustomNumber
 The CustomNumber class represents a custom numeric filter expression.
BoltFilterExpressions.CustomString
 The CustomString class represents a custom string filter expression.
BoltFilterExpressions.Length
 The Length class represents the length filter expression.
BoltFilterExpressions.Phase
 The Phase class represents the phase filter expression.
BoltFilterExpressions.SiteWorkshop
 The SiteWorkshop class represents the site/workshop filter expression.
BoltFilterExpressions.Size
 The Size class represents the size filter expression.
BoltFilterExpressions.Standard
 The Standard class represents the standard filter expression.
ComponentFilterExpressions
 The ComponentFilterExpressions class contains all the component filter expressions.
ComponentFilterExpressions.ConnectionCode
 The ConnectionCode class represents the connection code filter expression.
ComponentFilterExpressions.CustomBoolean
 The CustomBoolean class represents a custom Boolean filter expression.
ComponentFilterExpressions.CustomDateTime
 The CustomDateTime class represents a custom DateTime filter expression.
ComponentFilterExpressions.CustomNumber
 The CustomNumber class represents a custom numeric filter expression.
ComponentFilterExpressions.CustomString
 The CustomString class represents a custom string filter expression.
ComponentFilterExpressions.Name
 The Name class represents the name filter expression.
ComponentFilterExpressions.Phase
 The Phase class represents the phase filter expression.
ComponentFilterExpressions.RunningNumber
 The RunningNumber class represents the running number filter expression.
ConstructionObjectFilterExpressions
 The ConstructionObjectFilterExpressions class contains all the construction object filter expressions.
ConstructionObjectFilterExpressions.CustomBoolean
 The CustomBoolean class represents a custom Boolean filter expression.
ConstructionObjectFilterExpressions.CustomDateTime
 The CustomDateTime class represents a custom DateTime filter expression.
ConstructionObjectFilterExpressions.CustomNumber
 The CustomNumber class represents a custom numeric filter expression.
ConstructionObjectFilterExpressions.CustomString
 The CustomString class represents a custom string filter expression.
ConstructionObjectFilterExpressions.Phase
 The Phase class represents the phase filter expression.
ConstructionObjectFilterExpressions.Type
 The Type class represents the type filter expression.
LoadFilterExpressions
 The LoadFilterExpressions class contains all the load filter expressions.
LoadFilterExpressions.CustomBoolean
 The CustomBoolean class represents a custom Boolean filter expression.
LoadFilterExpressions.CustomDateTime
 The CustomDateTime class represents a custom DateTime filter expression.
LoadFilterExpressions.CustomNumber
 The CustomNumber class represents a custom numeric filter expression.
LoadFilterExpressions.CustomString
 The CustomString class represents a custom string filter expression.
LoadFilterExpressions.Group
 The Group class represents the group filter expression.
LoadFilterExpressions.Phase
 The Phase class represents the phase filter expression.
LoadFilterExpressions.Type
 The Type class represents the type filter expression.
LogicalAreaFilterExpressions
 The LogicalAreaFilterExpressions class contains all the logical area filter expressions.
LogicalAreaFilterExpressions.Building
 The Building class represents the building filter expression.
LogicalAreaFilterExpressions.CustomBoolean
 The CustomBoolean class represents a custom Boolean filter expression.
LogicalAreaFilterExpressions.CustomDateTime
 The CustomDateTime class represents a custom DateTime filter expression.
LogicalAreaFilterExpressions.CustomNumber
 The CustomNumber class represents a custom numeric filter expression.
LogicalAreaFilterExpressions.CustomString
 The CustomString class represents a custom string filter expression.
LogicalAreaFilterExpressions.Section
 The Section class represents the section filter expression.
LogicalAreaFilterExpressions.Site
 The Site class represents the site filter expression.
LogicalAreaFilterExpressions.Story
 The Story class represents the story filter expression.
ObjectFilterExpressions
 The ObjectFilterExpressions class contains all the object filter expressions.
ObjectFilterExpressions.CustomBoolean
 The CustomBoolean class represents a custom Boolean filter expression.
ObjectFilterExpressions.CustomDateTime
 The CustomDateTime class represents a custom DateTime filter expression.
ObjectFilterExpressions.CustomNumber
 The CustomNumber class represents a custom numeric filter expression.
ObjectFilterExpressions.CustomString
 The CustomString class represents a custom string filter expression.
ObjectFilterExpressions.Guid
 The Guid class represents the GUID filter expression.
ObjectFilterExpressions.IdNumber
 The IdNumber class represents the identifier number filter expression.
ObjectFilterExpressions.IsComponent
 The IsComponent class represents the "is component" filter expression.
ObjectFilterExpressions.Phase
 The Phase class represents the phase filter expression.
ObjectFilterExpressions.Type
 The Type class represents the type filter expression.
ObjectTypesFilterExpressions
 The ObjectTypesFilterExpressions class contains all the object type filter expressions.
ObjectTypesFilterExpressions.CategoryName
 The CategoryName class represents the category name filter expression.
ObjectTypesFilterExpressions.CustomBoolean
 The CustomBoolean class represents a custom Boolean filter expression.
ObjectTypesFilterExpressions.CustomDateTime
 The CustomDateTime class represents a custom DateTime filter expression.
ObjectTypesFilterExpressions.CustomNumber
 The CustomNumber class represents a custom numeric filter expression.
ObjectTypesFilterExpressions.CustomString
 The CustomString class represents a custom string filter expression.
ObjectTypesFilterExpressions.EntityName
 The EntityName class represents the entity name filter expression.
PartFilterExpressions
 The PartFilterExpressions class contains all the part filter expressions.
PartFilterExpressions.Class
 The Class class represents the class filter expression.
PartFilterExpressions.CustomBoolean
 The CustomBoolean class represents a custom Boolean filter expression.
PartFilterExpressions.CustomDateTime
 The CustomDateTime class represents a custom DateTime filter expression.
PartFilterExpressions.CustomNumber
 The CustomNumber class represents a custom numeric filter expression.
PartFilterExpressions.CustomString
 The CustomString class represents a custom string filter expression.
PartFilterExpressions.Finish
 The Finish class represents the finish filter expression.
PartFilterExpressions.Lot
 The Lot class represents the lot filter expression.
PartFilterExpressions.Material
 The Material class represents the material filter expression.
PartFilterExpressions.Name
 The Name class represents the name filter expression.
PartFilterExpressions.NumberingSeries
 The NumberingSeries class represents the numbering series filter expression.
PartFilterExpressions.Phase
 The Phase class represents the phase filter expression.
PartFilterExpressions.PositionNumber
 The PositionNumber class represents the position number filter expression.
PartFilterExpressions.PourPhase
 The PourPhase class represents the pour phase filter expression.
PartFilterExpressions.Prefix
 The Prefix class represents the prefix filter expression.
PartFilterExpressions.PrimaryPart
 The PrimaryPart class represents the primary part filter expression.
PartFilterExpressions.Profile
 The Profile class represents the profile filter expression.
PartFilterExpressions.StartNumber
 The StartNumber class represents the start number filter expression.
PourBreakFilterExpressions
 The PourBreakFilterExpressions class contains all the pour break filter expressions.
PourBreakFilterExpressions.CustomBoolean
 The CustomBoolean class represents a custom Boolean filter expression.
PourBreakFilterExpressions.CustomDateTime
 The CustomDateTime class represents a custom DateTime filter expression.
PourBreakFilterExpressions.CustomNumber
 The CustomNumber class represents a custom numeric filter expression.
PourBreakFilterExpressions.CustomString
 The CustomString class represents a custom string filter expression.
PourObjectFilterExpressions
 The PourObjectFilterExpressions class contains all the pour object filter expressions.
PourObjectFilterExpressions.ConcreteMixture
 The ConcreteMixture class represents the concrete mixture filter expression.
PourObjectFilterExpressions.CustomBoolean
 The CustomBoolean class represents a custom Boolean filter expression.
PourObjectFilterExpressions.CustomDateTime
 The CustomDateTime class represents a custom DateTime filter expression.
PourObjectFilterExpressions.CustomNumber
 The CustomNumber class represents a custom numeric filter expression.
PourObjectFilterExpressions.CustomString
 The CustomString class represents a custom string filter expression.
PourObjectFilterExpressions.Material
 The Material class represents the material filter expression.
PourObjectFilterExpressions.PourNumber
 The PourNumber class represents the pour number filter expression.
PourObjectFilterExpressions.PourPhase
 The PourPhase class represents the pour phase filter expression.
PourObjectFilterExpressions.PourType
 The PourType class represents the pour type filter expression.
PourUnitFilterExpressions
 The PourUnitFilterExpressions class contains all the pour unit filter expressions.
PourUnitFilterExpressions.CustomBoolean
 The CustomBoolean class represents a custom Boolean filter expression.
PourUnitFilterExpressions.CustomDateTime
 The CustomDateTime class represents a custom DateTime filter expression.
PourUnitFilterExpressions.CustomNumber
 The CustomNumber class represents a custom numeric filter expression.
PourUnitFilterExpressions.CustomString
 The CustomString class represents a custom string filter expression.
PourUnitFilterExpressions.Guid
 The Guid class represents the GUID filter expression.
PourUnitFilterExpressions.Name
 The Name class represents the name filter expression.
ReferenceObjectFilterExpressions
 The ReferenceObjectFilterExpressions class contains all the reference object filter expressions.
ReferenceObjectFilterExpressions.CustomBoolean
 The CustomBoolean class represents a custom Boolean filter expression.
ReferenceObjectFilterExpressions.CustomDateTime
 The CustomDateTime class represents a custom DateTime filter expression.
ReferenceObjectFilterExpressions.CustomNumber
 The CustomNumber class represents a custom numeric filter expression.
ReferenceObjectFilterExpressions.CustomString
 The CustomString class represents a custom string filter expression.
ReinforcingBarFilterExpressions
 The ReinforcingBarFilterExpressions class contains all the reinforcing bar filter expressions.
ReinforcingBarFilterExpressions.Class
 The Class class represents the class filter expression.
ReinforcingBarFilterExpressions.CustomBoolean
 The CustomBoolean class represents a custom Boolean filter expression.
ReinforcingBarFilterExpressions.CustomDateTime
 The CustomDateTime class represents a custom DateTime filter expression.
ReinforcingBarFilterExpressions.CustomNumber
 The CustomNumber class represents a custom numeric filter expression.
ReinforcingBarFilterExpressions.CustomString
 The CustomString class represents a custom string filter expression.
ReinforcingBarFilterExpressions.Diameter
 The Diameter class represents the diameter filter expression.
ReinforcingBarFilterExpressions.JoinType
 The JoinType class represents the join type filter expression.
ReinforcingBarFilterExpressions.Length
 The Length class represents the length filter expression.
ReinforcingBarFilterExpressions.Material
 The Material class represents the material filter expression.
ReinforcingBarFilterExpressions.Name
 The Name class represents the name filter expression.
ReinforcingBarFilterExpressions.NumberingSeries
 The NumberingSeries class represents the numbering series filter expression.
ReinforcingBarFilterExpressions.Phase
 The Phase class represents the phase filter expression.
ReinforcingBarFilterExpressions.Position
 The Position class represents the position filter expression.
ReinforcingBarFilterExpressions.PositionNumber
 The PositionNumber class represents the position number filter expression.
ReinforcingBarFilterExpressions.Prefix
 The Prefix class represents the prefix filter expression.
ReinforcingBarFilterExpressions.Shape
 The Shape class represents the shape filter expression.
ReinforcingBarFilterExpressions.Size
 The Size class represents the size filter expression.
ReinforcingBarFilterExpressions.StartNumber
 The StartNumber class represents the start number filter expression.
SurfaceFilterExpressions
 The SurfaceFilterExpressions class contains all the surface object filter expressions.
SurfaceFilterExpressions.Class
 The Class class represents the class filter expression.
SurfaceFilterExpressions.CustomBoolean
 The CustomBoolean class represents a custom Boolean filter expression.
SurfaceFilterExpressions.CustomDateTime
 The CustomDateTime class represents a custom DateTime filter expression.
SurfaceFilterExpressions.CustomNumber
 The CustomNumber class represents a custom numeric filter expression.
SurfaceFilterExpressions.CustomString
 The CustomString class represents a custom string filter expression.
SurfaceFilterExpressions.Name
 The Name class represents the name filter expression.
SurfaceFilterExpressions.Type
 The Type class represents the type filter expression.
TaskFilterExpressions
 The TaskFilterExpressions class contains all the task filter expressions.
TaskFilterExpressions.ActualEndDate
 The ActualEndDate class represents the actual end date filter expression.
TaskFilterExpressions.ActualStartDate
 The ActualStartDate class represents the actual start date filter expression.
TaskFilterExpressions.Completeness
 The Completeness class represents the completeness filter expression.
TaskFilterExpressions.Critical
 The Critical class represents the critical filter expression.
TaskFilterExpressions.CustomBoolean
 The CustomBoolean class represents a custom Boolean filter expression.
TaskFilterExpressions.CustomDateTime
 The CustomDateTime class represents a custom DateTime filter expression.
TaskFilterExpressions.CustomNumber
 The CustomNumber class represents a custom numeric filter expression.
TaskFilterExpressions.CustomString
 The CustomString class represents a custom string filter expression.
TaskFilterExpressions.Local
 The Local class represents the local filter expression.
TaskFilterExpressions.Name
 The Name class represents the name filter expression.
TaskFilterExpressions.PlannedEndDate
 The PlannedEndDate class represents the planned end date filter expression.
TaskFilterExpressions.PlannedStartDate
 The PlannedStartDate class represents the planned start date filter expression.
TemplateFilterExpressions
 The TemplateFilterExpressions class contains all the template filter expressions.
TemplateFilterExpressions.CustomBoolean
 The CustomBoolean class represents a custom Boolean filter expression.
TemplateFilterExpressions.CustomDateTime
 The CustomDateTime class represents a custom DateTime filter expression.
TemplateFilterExpressions.CustomNumber
 The CustomNumber class represents a custom numeric filter expression.
TemplateFilterExpressions.CustomString
 The CustomString class represents a custom string filter expression.
WeldFilterExpressions
 The WeldFilterExpressions class contains all the weld filter expressions.
WeldFilterExpressions.CustomBoolean
 The CustomBoolean class represents a custom Boolean filter expression.
WeldFilterExpressions.CustomDateTime
 The CustomDateTime class represents a custom DateTime filter expression.
WeldFilterExpressions.CustomNumber
 The CustomNumber class represents a custom numeric filter expression.
WeldFilterExpressions.CustomString
 The CustomString class represents a custom string filter expression.
WeldFilterExpressions.Phase
 The Phase class represents the phase filter expression.
WeldFilterExpressions.PositionNumber
 The PositionNumber class represents the position number filter expression.
WeldFilterExpressions.ReferenceText
 The ReferenceText class represents the reference text filter expression.
WeldFilterExpressions.SizeAboveLine
 The SizeAboveLine class represents the size above line filter expression.
WeldFilterExpressions.SizeBelowLine
 The SizeBelowLine class represents the size below line filter expression.
WeldFilterExpressions.TypeAboveLine
 The TypeAboveLine class represents the type above line filter expression.
WeldFilterExpressions.TypeBelowLine
 The TypeBelowLine class represents the type below line filter expression.
WeldFilterExpressions.WeldingSite
 The WeldingSite class represents the welding site filter expression.